{
    "version": "https://jsonfeed.org/version/1",
    "title": "Vincent Hwang",
    "home_page_url": "http://localhost:4000/",
    "feed_url": "http://localhost:4000/feed.json",
    "description": "Homepage",
    "icon": "http://localhost:4000/apple-touch-icon.png",
    "favicon": "http://localhost:4000/favicon.ico",
    "expired": false,
    
    "author": "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}",
    
"items": [
    
        {
            "id": "http://localhost:4000/2021/09/25/vids1",
            "title": "Anime Art Collection",
            "summary": "sakuga, art",
            "content_text": "Evangelion:Sakuga:",
            "content_html": "<p>Evangelion:</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/BTnAgsnnpcM\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe><p>Sakuga:</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/j5ZvnqgvfjU\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>",
            "url": "http://localhost:4000/2021/09/25/vids1",
            
            
            
            "tags": ["anime","kanye","art"],
            
            "date_published": "2021-09-25T00:00:00-07:00",
            "date_modified": "2021-09-25T00:00:00-07:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2021/04/30/hello-world",
            "title": "Hello World 2.0",
            "summary": "Inspiration behind version 2 of my website and blog.",
            "content_text": "Welcome to version 2.0 of my blog!In the summer of 2017, during my first co-op term, I completed my first coding side project: a personal blog and website built using Jekyll and Ruby. This came after I was first introduced to programming by a few of my friends during my first year of undergrad at the University of Waterloo.       Screenshots from version 1.0 of my websiteFor me, it was a big achievement. From knowing pretty much nothing about coding as I entered university, I learned to master the command line, install packages, manage repositories through Git, and write Ruby code. I remember feeling proud, and I hoped it would be the start of many more projects to come.However, throughout the rest of my undergraduate in which I studied Civil Engineering, I was more or less always busy. Lectures often lasted from 8:30am to 5pm, five days a week. I spent my remaining time finishing projects and coursework, leading programs at the Chinese Christian Fellowship, and playing intramural sports. I had little time left for coding and side projects. Eventually, I even stopped updating my website.In the back of my mind, though, I knew always wanted to move towards the software and technology sector. I enjoyed learning new algorithms and writing code. Through coding, I possessed the power to change the world at my fingertips.I am launching version 2.0 of my blog to document my personal journey post-graduation. I am hoping to break in to the software industry, preferably working on data science and artificial intelligence. It may be a long and hard road, but I am eager to begin the next chapter of my life.",
            "content_html": "<p>Welcome to version 2.0 of my blog!</p><p>In the summer of 2017, during my first co-op term, I completed my first coding side project: a personal blog and website built using Jekyll and Ruby. This came after I was first introduced to programming by a few of my friends during my first year of undergrad at the University of Waterloo.</p><p float=\"left\">  <img src=\"/assets/img/helloworld1.png\" width=\"350\" />  <img src=\"/assets/img/helloworld2.png\" width=\"350\" />   <figcaption>Screenshots from version 1.0 of my website</figcaption></p><p>For me, it was a big achievement. From knowing pretty much nothing about coding as I entered university, I learned to master the command line, install packages, manage repositories through Git, and write Ruby code. I remember feeling proud, and I hoped it would be the start of many more projects to come.</p><p>However, throughout the rest of my undergraduate in which I studied Civil Engineering, I was more or less always busy. Lectures often lasted from 8:30am to 5pm, five days a week. I spent my remaining time finishing projects and coursework, leading programs at the Chinese Christian Fellowship, and playing intramural sports. I had little time left for coding and side projects. Eventually, I even stopped updating my website.</p><p>In the back of my mind, though, I knew always wanted to move towards the software and technology sector. I enjoyed learning new algorithms and writing code. Through coding, I possessed the power to change the world at my fingertips.</p><p>I am launching version 2.0 of my blog to document my personal journey post-graduation. I am hoping to break in to the software industry, preferably working on data science and artificial intelligence. It may be a long and hard road, but I am eager to begin the next chapter of my life.</p>",
            "url": "http://localhost:4000/2021/04/30/hello-world",
            
            
            
            "tags": ["personal","blog"],
            
            "date_published": "2021-04-30T00:00:00-07:00",
            "date_modified": "2021-04-30T00:00:00-07:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/12/14/potter2",
            "title": "Harry Potter and its Christian Influences",
            "summary": "Essay Describing Christian Influence in the Harry Potter Series by JK Rowling",
            "content_text": "  Suggested Listening: Bach’s Mass in B Minor, one of the greatest music compositions ever.  Christianity has had and continues to have a profound influence on our society. From its roots in the Roman province of Judea early in the first century, Christian teaching has so strongly shaped the western world that it was once widely called Christendom. Our calendar marks the years since Jesus Christ. Some of the most popular statutory holidays, Christmas and Easter, draw their origins from Jesus’ birth and resurrection, respectively. Many classic pieces of literature, from John Milton’s Paradise Lost to CS Lewis’ Chronicles of Narnia, allude heavily to biblical stories. Milton’s epic recounts the fall of man as depicted in Genesis; Lewis’ The Lion, The Witch, and The Wardrobe is a retelling of the story of Jesus Christ (McGrath). While western society has moved away from its Christian roots towards secularism, so has western literature. Phillip Pullman’s His Dark Materials trilogy, for example, is explicitly atheist and anti-church (Parker). JK Rowling’s Harry Potter series, another highly popular work, finds itself sandwiched between Narnia and His Dark Materials. It neither promotes Christianity, nor does it oppose it. Nevertheless, the Potter series does contain significant Christian influence. Rowling draws significantly from Christian ethics, tradition, and scripture to form her wizarding world.Principles of Christian morality and ethics are evident throughout the Harry Potter novels. St Paul the Apostle, in his letter to the Galatians, writes that the fruit of the Holy Spirit (Christian virtues) are “love, joy, peace, patience, kindness, goodness, faithfulness, gentleness and self-control” (English Standard Version, Gal. 5.22-23). These are the traits that Rowling promotes throughout the entire series. Love, the greatest virtue (1 Cor 13.13), is preached by Albus Dumbledore multiple times. In the Philosophers Stone, he explains that Lily Potter’s act of sacrificial love was the sole reason that Harry had survived Voldemort’s attack. In the Half-Blood Prince, Dumbledore exclaims to Harry:”You are protected, in short, by your ability to love!” (Half Blood Prince 424). The other virtues are similarly encouraged as well. Snape’s Occlumency lessons teach Harry the importance of managing his emotions, which is a form of self-control. Hermione’s S.P.E.W. campaign to free the house-elves of slavery is done out of the goodness of her heart. Ron displays immense loyalty to his friends and his house, showing faithfulness. Biblical virtues characterize Rowling’s protagonists.Not only does Rowling draw from biblical morality to characterize her protagonists, she does so for her antagonists as well. Voldemort and his Death Eaters are the antithesis to Harry and his friends. Whereas Harry’s group operates with virtue, Voldemort’s group operates out of the opposite. They torture and kill for the sake of their own gain. Voldemort, out of his lust for immortality, murders the innocent to split his soul and create horcruxes. Bellatrix and other Death Eaters torture Neville’s parents into insanity. In biblical terms, this behavior is sin. St. Paul describes the sinful as those who are “full of envy, murder, strife, deceit”, and “maliciousness” (Rom 1.29). This describes the Death Eaters quite well. Harry and Voldemort’s contrasting moralities mirror those found in The City of God, a work authored by St. Augustine, a 4th century Christian theologian (Wolosky 192). The City of God contrasts two cities – the earthly city and the heavenly city. While the earthly city is characterized by the love of self – resulting in power, lust, and greed, the heavenly city is characterized by the love of God, leading to love, commitment, and mutual service. Says Augustine: “In the one, the princes and the nations it subdues are ruled by the love of ruling; in the other, the princes and the subjects serve one another in love” (14:28). Wolosky associates the earthly city with Voldemort’s society – a society where one is prepared, even eager, to put another down for the sake of personal gain. He associates the heavenly city with Harry, his friends, and Dumbledore’s army – people who are ready to sacrifice themselves out of love for their friends and loved ones. The entire moral framework in Harry Potter is taken directly from the Christian framework.Additionally, allusions to Biblical concepts are scattered throughout the wizarding world. In Christian tradition, the soul is the “essential life” of a person, the “one thing that [one] must never lose (Bloom). Jesus himself said, “what does it profit a man to gain the whole world and forfeit his soul?” (Mark 8.36). Rowling alludes to the biblical idea of the soul in her creation of the horcrux, considered the darkest form of magic in the wizarding world. Horcruxes are made by the act of splitting the soul. This is accomplished by committing murder, the “supreme act of evil” (Half Blood Prince 412). The creation of a horcrux tarnishes a soul beyond repair; thus Voldemort, in creating them, forfeits his soul and gives up his humanity for power and immortality. His physical appearance, seemingly less human as he transitions from Tom Riddle to the Dark Lord, reinforces this loss of humanity. What is also notable is that Voldemort split his soul not once, but seven times. In Christianity, the number seven represents perfection, completeness and wholeness (Smyth). Dumbledore echoes this sentiment, explaining to Harry that seven is “the most powerfully magical number” (Half Blood Prince 418), and therefore a seven-part soul would be extremely appealing to Voldemort.Furthermore, Rowling directly quotes scripture. When Harry visits the graveyard at Godric’s Hollow in the Deathly Hallows, the inscriptions on the two tombstones are Bible verses. The first epitaph, on Kendra and Ariana Dumbledore’s gravestone, is a direct quotation of Matthew 6:21: “where your treasure is, there your heart is also” (Deathly Hallows 265). The second, on Lily and James Potter’s tombstone, is from 1 Corinthians 15:26: “the last enemy that shall be destroyed is death” (267). Theologian Peter Ciacco suggests a significant relationship between the verses and Harry’s character and actions in the novels. The first verse, Matthew 6:21, is representative of Harry’s circumstances. The wizarding world, as opposed to the muggle world, is where Harry’s true treasures are (Ciacco 38). His treasure goes beyond his material wealth found in Gringott’s vault; everything that makes life meaningful to Harry – Hogwarts, his friends, and his family, is found in the wizarding world. Thus, it is where his heart truly lies. The second verse, 1 Corinthians 15:26, has bearing on the plot of the final novel. At the climax of the series, during the final battle between Harry and Voldemort, “Harry resolves to die in order to destroy death” (Ciacco 39). He accepts that he, along with the final horcrux inside him, “must die” in order for Voldemort to die as well (Deathly Hallows 566). Harry willingly accepting his own death allows him to acquire the three deathly hallows.Perhaps most significant of all is the clear allusion to the Christian gospel during the final battle. The gospel, (Greek euangelion) is the story of the redemption of the world through Christ’s death and resurrection. It teaches that all people have sinned and fallen short of God’s standard, and as a result, deserve eternal punishment and separation from God. The centre of the gospel and of the entire Bible is when Jesus, the perfect Son of God, takes upon himself the sins and punishment of his people, in order that they might reconciled to God and gain eternal life. Jesus willingly laid down his own life at the cross and rose from the grave on the third day, defeating sin, death, and Satan once and for all. Rowling’s allusion to the gospel is evident in the Deathly Hallows. After Harry discovers that he is the last horcrux, he understands that he must die in order to defeat Voldemort. It is through announcing his intention: “I am about to die” (Deathly Hallows 570), that he is able to obtain one of the hallows, the aptly named resurrection stone, from the golden snitch. Later, when Harry is stuck by the Adavra Kedavra curse, it seems as though Harry did indeed die. Voldemort cries his victory, and all hope seems lost. However, Harry is not actually killed, leading to shouts of “He’s Alive!” (603) when Harry emerges from his silence by protecting Ms. Weasley. Harry appears to die and resurrect in order to defeat Voldemort. As critic Bill McCarron comments, “it is undeniable that Harry is a Christ figure”. It is clear, however, that Rowling’s story is not an allegory of the gospel. Harry does not take the sins of his people upon himself, nor does he actually die and resurrect. Harry does not represent Christ; he is just a simple human being.In a society that is leaving Christianity behind, the Harry Potter novels serve as a reminder of its religious roots. Rowling draws significantly from biblical ethics, tradition, and scripture to shape the novels beloved by so many. Most significantly, Rowling alludes to the gospel, a story of redemption, at the climax of the story.Just as Christianity is a religion of hope, so too is Harry Potter a series about hope. As Emily Griesinger concludes, “We gain hope from Harry Potter—hope that in an age where moral goodness does not seem important and where evil is on the rise, one little nerdy person, not terribly smart or good-looking, can make a difference” (478).Works Cited:Augustine. The City of God. Ed. David Knowles. New York: Penguin, 1980.Bloom, Jon. “The One Thing You Must Never Lose.” Desiring God, 14 Dec. 2020.Ciaccio, Peter. “Harry Potter and Christian Theology.” Critical Perspectives on Harry Potter, Routledge, Jan. 2009, pp. 33–46.English Standard Version. Bible Gateway. Web. 25 Oct. 2012.Griesinger, Emily. “Harry Potter and the ‘Deeper Magic’: Narrating Hope in Children’s Literature.” Christianity and Literature, vol. 51, no. 3, 2002, pp. 455–480.McCarron, Bill. “Christianity in Harry Potter and the Deathly Hallows.” Notes on Contemporary Literature., vol. 39, no. 1, West Georgia College, Jan. 2009, pp. 10–12.McGrath, Alister. “The Religious Symbolism behind the Chronicles of Narnia.” BBC Religion and Ethics, 2013, wwrn.org/articles/41198/.Parker, James. “Philip Pullman’s Problem With God.” The Atlantic, Atlantic Media Company, 15 Oct. 2019.Rowling, J. K. Harry Potter and the Philosopher’s Stone. London, Bloomsbury, 2014Rowling, J. K. Harry Potter and the Half-Blood Prince. London, Bloomsbury, 2014Rowling, J. K. Harry Potter and the Deathly Hallows. London, Bloomsbury, 2014Smyth, Dolores. “What Is the Biblical Significance of the Number 7?” Christianity.com, Salem Web Network, 31 Jan. 2020.Wolosky, Shira. “Harry Potter’s Ethical Paradigms: Augustine, Kant, and Feminist Moral Theory.” Children’s Literature, vol. 40, 2012, pp. 191-217,323.",
            "content_html": "<blockquote>  <p>Suggested Listening: Bach’s Mass in B Minor, one of the greatest music compositions ever.</p>  <iframe src=\"https://open.spotify.com/embed/album/3HdmIB3Wzcd7bFDdsgaIbp?theme=0\" width=\"100%\" height=\"80\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\"></iframe></blockquote><p>Christianity has had and continues to have a profound influence on our society. From its roots in the Roman province of Judea early in the first century, Christian teaching has so strongly shaped the western world that it was once widely called Christendom. Our calendar marks the years since Jesus Christ. Some of the most popular statutory holidays, Christmas and Easter, draw their origins from Jesus’ birth and resurrection, respectively. Many classic pieces of literature, from John Milton’s <em>Paradise Lost</em> to CS Lewis’ <em>Chronicles of Narnia</em>, allude heavily to biblical stories. Milton’s epic recounts the fall of man as depicted in Genesis; Lewis’ <em>The Lion, The Witch, and The Wardrobe</em> is a retelling of the story of Jesus Christ (McGrath). While western society has moved away from its Christian roots towards secularism, so has western literature. Phillip Pullman’s <em>His Dark Materials</em> trilogy, for example, is explicitly atheist and anti-church (Parker). JK Rowling’s Harry Potter series, another highly popular work, finds itself sandwiched between Narnia and His Dark Materials. It neither promotes Christianity, nor does it oppose it. Nevertheless, the Potter series does contain significant Christian influence. Rowling draws significantly from Christian ethics, tradition, and scripture to form her wizarding world.</p><p>Principles of Christian morality and ethics are evident throughout the Harry Potter novels. St Paul the Apostle, in his letter to the Galatians, writes that the fruit of the Holy Spirit (Christian virtues) are “love, joy, peace, patience, kindness, goodness, faithfulness, gentleness and self-control” (<em>English Standard Version</em>, Gal. 5.22-23). These are the traits that Rowling promotes throughout the entire series. Love, the greatest virtue (1 Cor 13.13), is preached by Albus Dumbledore multiple times. In the <em>Philosophers Stone,</em> he explains that Lily Potter’s act of sacrificial love was the sole reason that Harry had survived Voldemort’s attack. In the <em>Half-Blood Prince,</em> Dumbledore exclaims to Harry:”You are protected, in short, by your ability to love!” (<em>Half Blood Prince</em> 424). The other virtues are similarly encouraged as well. Snape’s Occlumency lessons teach Harry the importance of managing his emotions, which is a form of self-control. Hermione’s S.P.E.W. campaign to free the house-elves of slavery is done out of the goodness of her heart. Ron displays immense loyalty to his friends and his house, showing faithfulness. Biblical virtues characterize Rowling’s protagonists.</p><p>Not only does Rowling draw from biblical morality to characterize her protagonists, she does so for her antagonists as well. Voldemort and his Death Eaters are the antithesis to Harry and his friends. Whereas Harry’s group operates with virtue, Voldemort’s group operates out of the opposite. They torture and kill for the sake of their own gain. Voldemort, out of his lust for immortality, murders the innocent to split his soul and create horcruxes. Bellatrix and other Death Eaters torture Neville’s parents into insanity. In biblical terms, this behavior is sin. St. Paul describes the sinful as those who are “full of envy, murder, strife, deceit”, and “maliciousness” (Rom 1.29). This describes the Death Eaters quite well. Harry and Voldemort’s contrasting moralities mirror those found in <em>The City of God</em>, a work authored by St. Augustine, a 4th century Christian theologian (Wolosky 192). <em>The City of God</em> contrasts two cities – the earthly city and the heavenly city. While the earthly city is characterized by the love of self – resulting in power, lust, and greed, the heavenly city is characterized by the love of God, leading to love, commitment, and mutual service. Says Augustine: “In the one, the princes and the nations it subdues are ruled by the love of ruling; in the other, the princes and the subjects serve one another in love” (14:28). Wolosky associates the earthly city with Voldemort’s society – a society where one is prepared, even eager, to put another down for the sake of personal gain. He associates the heavenly city with Harry, his friends, and Dumbledore’s army – people who are ready to sacrifice themselves out of love for their friends and loved ones. The entire moral framework in Harry Potter is taken directly from the Christian framework.</p><p>Additionally, allusions to Biblical concepts are scattered throughout the wizarding world. In Christian tradition, the soul is the “essential life” of a person, the “one thing that [one] must never lose (Bloom). Jesus himself said, “what does it profit a man to gain the whole world and forfeit his soul?” (Mark 8.36). Rowling alludes to the biblical idea of the soul in her creation of the horcrux, considered the darkest form of magic in the wizarding world. Horcruxes are made by the act of splitting the soul. This is accomplished by committing murder, the “supreme act of evil” (<em>Half Blood Prince</em> 412). The creation of a horcrux tarnishes a soul beyond repair; thus Voldemort, in creating them, forfeits his soul and gives up his humanity for power and immortality. His physical appearance, seemingly less human as he transitions from Tom Riddle to the Dark Lord, reinforces this loss of humanity. What is also notable is that Voldemort split his soul not once, but seven times. In Christianity, the number seven represents perfection, completeness and wholeness (Smyth). Dumbledore echoes this sentiment, explaining to Harry that seven is “the most powerfully magical number” (<em>Half Blood Prince</em> 418), and therefore a seven-part soul would be extremely appealing to Voldemort.</p><p>Furthermore, Rowling directly quotes scripture. When Harry visits the graveyard at Godric’s Hollow in the <em>Deathly Hallows,</em> the inscriptions on the two tombstones are Bible verses. The first epitaph, on Kendra and Ariana Dumbledore’s gravestone, is a direct quotation of Matthew 6:21: “where your treasure is, there your heart is also” (<em>Deathly Hallows</em> 265). The second, on Lily and James Potter’s tombstone, is from 1 Corinthians 15:26: “the last enemy that shall be destroyed is death” (267). Theologian Peter Ciacco suggests a significant relationship between the verses and Harry’s character and actions in the novels. The first verse, Matthew 6:21, is representative of Harry’s circumstances. The wizarding world, as opposed to the muggle world, is where Harry’s true treasures are (Ciacco 38). His treasure goes beyond his material wealth found in Gringott’s vault; everything that makes life meaningful to Harry – Hogwarts, his friends, and his family, is found in the wizarding world. Thus, it is where his heart truly lies. The second verse, 1 Corinthians 15:26, has bearing on the plot of the final novel. At the climax of the series, during the final battle between Harry and Voldemort, “Harry resolves to die in order to destroy death” (Ciacco 39). He accepts that he, along with the final horcrux inside him, “must die” in order for Voldemort to die as well (<em>Deathly Hallows</em> 566). Harry willingly accepting his own death allows him to acquire the three deathly hallows.</p><p>Perhaps most significant of all is the clear allusion to the Christian gospel during the final battle. The gospel, (Greek <em>euangelion</em>) is the story of the redemption of the world through Christ’s death and resurrection. It teaches that all people have sinned and fallen short of God’s standard, and as a result, deserve eternal punishment and separation from God. The centre of the gospel and of the entire Bible is when Jesus, the perfect Son of God, takes upon himself the sins and punishment of his people, in order that they might reconciled to God and gain eternal life. Jesus willingly laid down his own life at the cross and rose from the grave on the third day, defeating sin, death, and Satan once and for all. Rowling’s allusion to the gospel is evident in the <em>Deathly Hallows</em>. After Harry discovers that he is the last horcrux, he understands that he must die in order to defeat Voldemort. It is through announcing his intention: “I am about to die” (<em>Deathly Hallows</em> 570), that he is able to obtain one of the hallows, the aptly named resurrection stone, from the golden snitch. Later, when Harry is stuck by the Adavra Kedavra curse, it seems as though Harry did indeed die. Voldemort cries his victory, and all hope seems lost. However, Harry is not actually killed, leading to shouts of “He’s Alive!” (603) when Harry emerges from his silence by protecting Ms. Weasley. Harry appears to die and resurrect in order to defeat Voldemort. As critic Bill McCarron comments, “it is undeniable that Harry is a Christ figure”. It is clear, however, that Rowling’s story is not an allegory of the gospel. Harry does not take the sins of his people upon himself, nor does he actually die and resurrect. Harry does not represent Christ; he is just a simple human being.</p><p>In a society that is leaving Christianity behind, the Harry Potter novels serve as a reminder of its religious roots. Rowling draws significantly from biblical ethics, tradition, and scripture to shape the novels beloved by so many. Most significantly, Rowling alludes to the gospel, a story of redemption, at the climax of the story.Just as Christianity is a religion of hope, so too is Harry Potter a series about hope. As Emily Griesinger concludes, “We gain hope from Harry Potter—hope that in an age where moral goodness does not seem important and where evil is on the rise, one little nerdy person, not terribly smart or good-looking, can make a difference” (478).</p><h4 id=\"works-cited\">Works Cited:</h4><p>Augustine. The City of God. Ed. David Knowles. New York: Penguin, 1980.</p><p>Bloom, Jon. “<a href=\"https://www.desiringgod.org/articles/the-one-thing-you-must-never-lose\">The One Thing You Must Never Lose.</a>” Desiring God, 14 Dec. 2020.</p><p>Ciaccio, Peter. “Harry Potter and Christian Theology.” Critical Perspectives on Harry Potter, Routledge, Jan. 2009, pp. 33–46.</p><p>English Standard Version. Bible Gateway. Web. 25 Oct. 2012.</p><p>Griesinger, Emily. “Harry Potter and the ‘Deeper Magic’: Narrating Hope in Children’s Literature.” Christianity and Literature, vol. 51, no. 3, 2002, pp. 455–480.</p><p>McCarron, Bill. “Christianity in Harry Potter and the Deathly Hallows.” Notes on Contemporary Literature., vol. 39, no. 1, West Georgia College, Jan. 2009, pp. 10–12.</p><p>McGrath, Alister. “The Religious Symbolism behind the Chronicles of Narnia.” BBC Religion and Ethics, 2013, wwrn.org/articles/41198/.</p><p>Parker, James. “<a href=\"https://www.theatlantic.com/magazine/archive/2019/11/can-atheism-animate-great-fantasy/598351/\">Philip Pullman’s Problem With God.</a>” <em>The Atlantic</em>, Atlantic Media Company, 15 Oct. 2019.</p><p>Rowling, J. K. <em>Harry Potter and the Philosopher’s Stone.</em> London, Bloomsbury, 2014</p><p>Rowling, J. K. <em>Harry Potter and the Half-Blood Prince.</em> London, Bloomsbury, 2014</p><p>Rowling, J. K. <em>Harry Potter and the Deathly Hallows.</em> London, Bloomsbury, 2014</p><p>Smyth, Dolores. “<a href=\"https://www.christianity.com/wiki/bible/what-is-the-biblical-significance-of-the-number-7.html\">What Is the Biblical Significance of the Number 7?</a>” <em>Christianity.com</em>, Salem Web Network, 31 Jan. 2020.</p><p>Wolosky, Shira. “Harry Potter’s Ethical Paradigms: Augustine, Kant, and Feminist Moral Theory.” Children’s Literature, vol. 40, 2012, pp. 191-217,323.</p>",
            "url": "http://localhost:4000/2020/12/14/potter2",
            
            
            
            "tags": ["harry potter","essay","gospel"],
            
            "date_published": "2020-12-14T00:00:00-08:00",
            "date_modified": "2020-12-14T00:00:00-08:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        },
    
        {
            "id": "http://localhost:4000/2020/10/25/potter1",
            "title": "Injustice and Discrimination in Harry Potter",
            "summary": "Essay Describing Injustice and Discrimination in the Harry Potter Series by JK Rowling",
            "content_text": "  Note 09/2021 - This essay was written for ENGL 108P, a course I took at Waterloo.  Suggested Listening:  In the Harry Potter novels, the readers are presented with characters of distinct backgrounds and species - from muggles to wizards, from humans to werewolves. From the very beginning of the series, animosity between different groups of characters is evident. Harry goes through abusive treatment from the Dursley family simply because he is a wizard. At Hogwarts, Draco vilifies Hermione because she is from a non-magical background. In addition to conflicts between humans, the reader is exposed to injustices the wizarding world commits against other humanoid creatures, such as goblins, giants, and house elves. In a comment on the class discussion board in Module 3, Luke Fahrer describes the routine mistreatment of gnomes by “one of the most heroic and morally virtuous families in the series” as pointing towards the “lack of sympathy” ingrained within the wizarding society. Expounding on Fahrer’s point, Rowling uses the mistreatment of characters different in appearance from the common witch and wizard to bring to light prevalent issues that are faced in our own world today.It should be noted that Rowling employs the racial grotesque to minimize the reader’s sympathy towards these humanoid characters. As these characters appear monstrous, differing in form when compared with a normal human, the reader feels little need to sympathize. In Harry Potter and the Chamber of Secrets, gnomes are plucked and tossed like a game, though they scream “Geroff me!” (39). Mandrakes are unrooted for medication, though they were “bawling” (73). Through the racial grotesque, the reader overlooks the emotions of the gnomes and mandrakes. It is not until the reader journeys with more prominent characters such as Dobby the house-elf and Lupin the werewolf they become more clearly aware of the injustice committed towards humanoid species by the wizarding world. Rowling uses the grotesque to show how little we sympathize with those who look fundamentally different from us. One doesn’t have to look far back in history to find examples of such discrimination. In Germany, Hitler championed the supremacy of the Arian race. Even right now, in the US, there are still those who ascribe to white supremacy. Rowling uses her novels to condemn this type of behavior and teach the reader about accepting those who are different.One particular societal issue that Rowling depicts through her humanoid characters is the issue of slavery. Out of all the humanoid species, the house elves are the only ones enslaved, being bound to lifetime service to their wizard masters. Though they are fully sentient beings, they have no free will of their own – they must obey their masters, or be subject to punishment. In the Chamber of Secrets, Dobby punishes himself by punching his own head when he thinks of disobeying the Malfoys. At the Quiddich World Cup, in the Goblet of Fire, Winky is forced to be in the top box though she is scared of heights, and publicly humiliated by her master, Mr. Crouch. In the wizarding world, the enslavement of house elves is so deeply ingrained that no one sees a problem with it – until Harry and Hermione come along, both whom were raised outside of the dominant wizarding society.Christine Scott, in her essay The House Elf Problem, explores the relationship between the house elves in Harry Potter and race-based slavery, using the elves Dobby, Kreacher, and Winky as examples. She likens the house-elves to the typical African American slave as portrayed by Hollywood films in the 1930’s and 40’s, with each house elf having a different response to their enslavement (261). Dobby is described as an “extraordinary” (264) individual, one who sacrifices himself for Harry as a “declaration of independence and a rebellion against the family that held him captive” (262-263). Scott describes Kreacher as having a different response to enslavement, as one who has “no will or self-determination of his own” (264), as “one that cannot independently overcome such an upbringing” (264). Scott then examines Winky, who, unlike Dobby, is devasted by being freed, developing an addiction for butterbeer in the process (266). Through the various examples of house elf enslavement present in the Harry Potter series, Rowling shows the lasting effects on those who have been enslaved.In addition, Rowling explores solutions to the issue of race-based slavery by having her main heroes and heroine be exposed to and react to the dire situation of the house elves. Harry, after witnessing Lucius Malfoy’s abuse of Dobby, devises a plan to free Dobby, for which Dobby was very grateful. Hermione, after witnessing Winky’s treatment by Crouch, devises S.P.E.W., a campaign to free the elves. Ron, initially ascribing to the wizarding consensus that house elves should being enslaved, learns to grow and change his mindset throughout the series. However, Rowling shows that the solution towards such an issue is not quite so simple. Scott comments that throughout the novels, Hermione’s S.P.E.W. campaign is largely a failure – that Hermione “disregards the will of the house elves” (272) and “attacks the problem with the ignorance of an outsider” (267). She notes that the novels themselves offer no solution to house elf slavery. Rowling does not try to offer a solution. Instead, she shows her readers just how multifaceted the problem of slavery is – that it has lasting effects and cannot be simply solved.Another humanoid that Rowling uses to portray issues in our society is the werewolf. In the Prisoner of Azkaban, we are introduced to Professor Lupin, a werewolf who has suffered discrimination over the course of his entire life. Immediately after Ron discovers that Lupin is a werewolf, he gasps “Get away from me, you werewolf” (367), though Ron has learned to trust Lupin as one of the best professors he’s ever had. When Snape reveals Lupin’s condition to the Ministry of Magic, Lupin leaves Hogwarts, as many parents would not “want a werewolf teaching their children” (450). Lupin’s shabby appearance is also attributed to the fact that as a werewolf, he could not easily find employment. The very fact that he is a werewolf – that he is different, subjects him to all kinds of mistreatment.In his essay Wolf in Professor’s Clothing, Brent Stypczynski describes Rowling’s use of the werewolf as a means for teaching her readers about the racial other, the terminally ill, and the nuances of morality. He likens the anti-werewolf prejudice in the wizarding world to racism, noting that “monstrosity” in literature often ties in to “questions of racial and/or ethnic identity” (58). He draws on multiple instances where Rowling uses the “vocabulary of race relations” when lupin is defamed (63). Stypczynski also notes Rowling’s werewolf as a stand-in for incurable illness. He describes common scholarly interpretations of Lupin’s lycanthropy, such as HIV, epilepsy, and MS (62). Lastly, and perhaps most strikingly, Stypczynski notes Lupin as an agent of morality in the series, that “ironically, the monstrous werewolf shows better sense of moral character judgement than many of the other supposed moral authorities, such as Fudge” (65). He examines the discrimination against Lupin, drawing parallels between the wizarding world and our own society.It is interesting to note that Rowling provides a second werewolf, Fernir Greyback, to illustrate the rage and anger that oppression could cause. In contrast to Professor Lupin, Greyback epitomizes the wizarding world’s view on werewolves. He terrorizes the wizarding population, having a particular fondness for biting children. Instead of attempting to coexist with the wizarding society, he attempts to destroy the society that shunned him. He strives to bite as many humans as possible in order raise a werewolf army to fight back against the wizards. Unlike Lupin, who fights his werewolf side and avoids biting others, Greyback is taken over by his werewolf nature, abandoning his humanity in the process. Stypczynski comments that Greyback is “both Lupin’s antithesis and that which Lupin could easily become” (64). Greyback responds in anger and retaliation towards his oppression. Rowling uses the contrast of character between Lupin and Greyback to illustrate the different effects oppression can have on different individuals.In the Harry Potter series, Rowling inserts numerous examples of discrimination against characters that are not part of the dominant human wizarding society. She invites her protagonists and her readers to journey with house elves and werewolves, exploring the issues of discrimination and oppression against outsiders. As Harry, Ron, and Hermione learn to accept Lupin, Dobby, and by extension the other humanoid characters, so does the reader. Rowling uses this journey of acceptance to bring to light issues we face in our own world. As Scott concludes, Rowling uses her novels to serve as “a positive force in a world of doubt and uncertainty” (272). She educates her readers on the horrors of slavery and discrimination and the difficulties of bringing about meaningful change. Her novels encourage the reader to take steps towards understanding and reconciliation – as it is only through these that the world will be made a better place.Works Cited:Rowling, J. K. Harry Potter and the Chamber of Secrets. London, Bloomsbury, 2014Rowling, J. K. Harry Potter and the Goblet of Fire. London, Bloomsbury, 2014Rowling, J. K. Harry Potter and the Prisoner of Azkaban. London, Bloomsbury, 2014Schott, Christine. “The House Elf Problem: Why Harry Potter is More Relevant Now than Ever.” The Midwest Quarterly, vol. 61, no. 2, 2020, pp. 259-272.Stypczynski, Brent. “Wolf in Professor’s Clothing: J. K. Rowling’s Werewolf as Educator.” Journal of the Fantastic in the Arts., vol. 20, no. 1, M.E. Sharpe, Jan. 2009, pp. 57–69.",
            "content_html": "<blockquote>  <p>Note 09/2021 - This essay was written for ENGL 108P, a course I took at Waterloo.</p></blockquote><blockquote>  <p>Suggested Listening:</p>  <iframe src=\"https://open.spotify.com/embed/album/6zeHM5CV0CjcS0K8ouWE4N\" width=\"100%\" height=\"80\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\"></iframe></blockquote><p>In the Harry Potter novels, the readers are presented with characters of distinct backgrounds and species - from muggles to wizards, from humans to werewolves. From the very beginning of the series, animosity between different groups of characters is evident. Harry goes through abusive treatment from the Dursley family simply because he is a wizard. At Hogwarts, Draco vilifies Hermione because she is from a non-magical background. In addition to conflicts between humans, the reader is exposed to injustices the wizarding world commits against other humanoid creatures, such as goblins, giants, and house elves. In a comment on the class discussion board in Module 3, Luke Fahrer describes the routine mistreatment of gnomes by “one of the most heroic and morally virtuous families in the series” as pointing towards the “lack of sympathy” ingrained within the wizarding society. Expounding on Fahrer’s point, Rowling uses the mistreatment of characters different in appearance from the common witch and wizard to bring to light prevalent issues that are faced in our own world today.</p><p>It should be noted that Rowling employs the racial grotesque to minimize the reader’s sympathy towards these humanoid characters. As these characters appear monstrous, differing in form when compared with a normal human, the reader feels little need to sympathize. In <em>Harry Potter and the Chamber of Secrets</em>, gnomes are plucked and tossed like a game, though they scream “Geroff me!” (39). Mandrakes are unrooted for medication, though they were “bawling” (73). Through the racial grotesque, the reader overlooks the emotions of the gnomes and mandrakes. It is not until the reader journeys with more prominent characters such as Dobby the house-elf and Lupin the werewolf they become more clearly aware of the injustice committed towards humanoid species by the wizarding world. Rowling uses the grotesque to show how little we sympathize with those who look fundamentally different from us. One doesn’t have to look far back in history to find examples of such discrimination. In Germany, Hitler championed the supremacy of the Arian race. Even right now, in the US, there are still those who ascribe to white supremacy. Rowling uses her novels to condemn this type of behavior and teach the reader about accepting those who are different.</p><p>One particular societal issue that Rowling depicts through her humanoid characters is the issue of slavery. Out of all the humanoid species, the house elves are the only ones enslaved, being bound to lifetime service to their wizard masters. Though they are fully sentient beings, they have no free will of their own – they must obey their masters, or be subject to punishment. In the <em>Chamber of Secrets</em>, Dobby punishes himself by punching his own head when he thinks of disobeying the Malfoys. At the Quiddich World Cup, in the <em>Goblet of Fire</em>, Winky is forced to be in the top box though she is scared of heights, and publicly humiliated by her master, Mr. Crouch. In the wizarding world, the enslavement of house elves is so deeply ingrained that no one sees a problem with it – until Harry and Hermione come along, both whom were raised outside of the dominant wizarding society.</p><p>Christine Scott, in her essay <em>The House Elf Problem</em>, explores the relationship between the house elves in Harry Potter and race-based slavery, using the elves Dobby, Kreacher, and Winky as examples. She likens the house-elves to the typical African American slave as portrayed by Hollywood films in the 1930’s and 40’s, with each house elf having a different response to their enslavement (261). Dobby is described as an “extraordinary” (264) individual, one who sacrifices himself for Harry as a “declaration of independence and a rebellion against the family that held him captive” (262-263). Scott describes Kreacher as having a different response to enslavement, as one who has “no will or self-determination of his own” (264), as “one that cannot independently overcome such an upbringing” (264). Scott then examines Winky, who, unlike Dobby, is devasted by being freed, developing an addiction for butterbeer in the process (266). Through the various examples of house elf enslavement present in the Harry Potter series, Rowling shows the lasting effects on those who have been enslaved.</p><p>In addition, Rowling explores solutions to the issue of race-based slavery by having her main heroes and heroine be exposed to and react to the dire situation of the house elves. Harry, after witnessing Lucius Malfoy’s abuse of Dobby, devises a plan to free Dobby, for which Dobby was very grateful. Hermione, after witnessing Winky’s treatment by Crouch, devises S.P.E.W., a campaign to free the elves. Ron, initially ascribing to the wizarding consensus that house elves should being enslaved, learns to grow and change his mindset throughout the series. However, Rowling shows that the solution towards such an issue is not quite so simple. Scott comments that throughout the novels, Hermione’s S.P.E.W. campaign is largely a failure – that Hermione “disregards the will of the house elves” (272) and “attacks the problem with the ignorance of an outsider” (267). She notes that the novels themselves offer no solution to house elf slavery. Rowling does not try to offer a solution. Instead, she shows her readers just how multifaceted the problem of slavery is – that it has lasting effects and cannot be simply solved.</p><p>Another humanoid that Rowling uses to portray issues in our society is the werewolf. In the <em>Prisoner of Azkaban</em>, we are introduced to Professor Lupin, a werewolf who has suffered discrimination over the course of his entire life. Immediately after Ron discovers that Lupin is a werewolf, he gasps “Get away from me, you werewolf” (367), though Ron has learned to trust Lupin as one of the best professors he’s ever had. When Snape reveals Lupin’s condition to the Ministry of Magic, Lupin leaves Hogwarts, as many parents would not “want a werewolf teaching their children” (450). Lupin’s shabby appearance is also attributed to the fact that as a werewolf, he could not easily find employment. The very fact that he is a werewolf – that he is different, subjects him to all kinds of mistreatment.</p><p>In his essay <em>Wolf in Professor’s Clothing</em>, Brent Stypczynski describes Rowling’s use of the werewolf as a means for teaching her readers about the racial other, the terminally ill, and the nuances of morality. He likens the anti-werewolf prejudice in the wizarding world to racism, noting that “monstrosity” in literature often ties in to “questions of racial and/or ethnic identity” (58). He draws on multiple instances where Rowling uses the “vocabulary of race relations” when lupin is defamed (63). Stypczynski also notes Rowling’s werewolf as a stand-in for incurable illness. He describes common scholarly interpretations of Lupin’s lycanthropy, such as HIV, epilepsy, and MS (62). Lastly, and perhaps most strikingly, Stypczynski notes Lupin as an agent of morality in the series, that “ironically, the monstrous werewolf shows better sense of moral character judgement than many of the other supposed moral authorities, such as Fudge” (65). He examines the discrimination against Lupin, drawing parallels between the wizarding world and our own society.</p><p>It is interesting to note that Rowling provides a second werewolf, Fernir Greyback, to illustrate the rage and anger that oppression could cause. In contrast to Professor Lupin, Greyback epitomizes the wizarding world’s view on werewolves. He terrorizes the wizarding population, having a particular fondness for biting children. Instead of attempting to coexist with the wizarding society, he attempts to destroy the society that shunned him. He strives to bite as many humans as possible in order raise a werewolf army to fight back against the wizards. Unlike Lupin, who fights his werewolf side and avoids biting others, Greyback is taken over by his werewolf nature, abandoning his humanity in the process. Stypczynski comments that Greyback is “both Lupin’s antithesis and that which Lupin could easily become” (64). Greyback responds in anger and retaliation towards his oppression. Rowling uses the contrast of character between Lupin and Greyback to illustrate the different effects oppression can have on different individuals.</p><p>In the Harry Potter series, Rowling inserts numerous examples of discrimination against characters that are not part of the dominant human wizarding society. She invites her protagonists and her readers to journey with house elves and werewolves, exploring the issues of discrimination and oppression against outsiders. As Harry, Ron, and Hermione learn to accept Lupin, Dobby, and by extension the other humanoid characters, so does the reader. Rowling uses this journey of acceptance to bring to light issues we face in our own world. As Scott concludes, Rowling uses her novels to serve as “a positive force in a world of doubt and uncertainty” (272). She educates her readers on the horrors of slavery and discrimination and the difficulties of bringing about meaningful change. Her novels encourage the reader to take steps towards understanding and reconciliation – as it is only through these that the world will be made a better place.</p><h4 id=\"works-cited\">Works Cited:</h4><p>Rowling, J. K. Harry Potter and the Chamber of Secrets. London, Bloomsbury, 2014</p><p>Rowling, J. K. Harry Potter and the Goblet of Fire. London, Bloomsbury, 2014</p><p>Rowling, J. K. Harry Potter and the Prisoner of Azkaban. London, Bloomsbury, 2014</p><p>Schott, Christine. “The House Elf Problem: Why Harry Potter is More Relevant Now than Ever.” The Midwest Quarterly, vol. 61, no. 2, 2020, pp. 259-272.</p><p>Stypczynski, Brent. “Wolf in Professor’s Clothing: J. K. Rowling’s Werewolf as Educator.” Journal of the Fantastic in the Arts., vol. 20, no. 1, M.E. Sharpe, Jan. 2009, pp. 57–69.</p>",
            "url": "http://localhost:4000/2020/10/25/potter1",
            
            
            
            "tags": ["harry potter","essay","discrimination"],
            
            "date_published": "2020-10-25T00:00:00-07:00",
            "date_modified": "2020-10-25T00:00:00-07:00",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>nil, "url"=>nil}"
                
            
        }
    
    ]
}